---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.SetBoldStatus(System.Boolean)
source: html/5147f4db-4b72-0596-cecb-dac6487ca178.htm
---
# Autodesk.Revit.DB.FormattedText.SetBoldStatus Method

Sets the characters in the entire text to be bold or not bold.

## Syntax (C#)
```csharp
public void SetBoldStatus(
	bool isBold
)
```

## Parameters
- **isBold** (`System.Boolean`) - The desired bold status of characters in the entire text.
 True to set bold, false to set not bold.